app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "MyString"], ["content", "MyText"], ["user_id", 1], ["created_at", 2017-03-17 15:26:27 UTC], ["updated_at", 2017-03-17 15:26:27 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save